[Killed] ArrayDeclaration
main/components/UCSBOrganization/UCSBOrganizationTable.js:29:21
     // Stryker disable next-line all : TODO try to make a good test for this
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
-    const columns = [
-        {
-            Header: 'orgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
-        },
-        {
-            Header: 'OrgTranslationShort',
-            accessor: 'orgTranslationShort',
-        },
-        {
-            Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
-        },
-        {
-            Header: 'Inactive',
-            id: 'inactive',
-            accessor: (row, _rowIndex) => String(row.inactive)
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: orgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:45:23
         {
             Header: 'Inactive',
             id: 'inactive',
-            accessor: (row, _rowIndex) => String(row.inactive)
+            accessor: () => undefined
         }
     ];
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
