[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:43:52
                             id="orgCode"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslationShort)}
-                            {...register("orgCode",{
-                                required: "orgCode is required."
-                            })}
+                            {...register("orgCode",{})}
                             //value={initialContents.orgCode}
                             
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:50:30
                             
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgCode && 'orgCode is required. '}
+                            {errors.orgCode || 'orgCode is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /orgCode/

Here are the matching elements:

<label
  class="form-label"
  for="orgCode"
>

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:50:30
                             
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgCode && 'orgCode is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:69:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgTranslationShort && 'orgTranslationShort is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:69:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgTranslationShort && 'orgTranslationShort is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:81:60
                             id="orgTranslation"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslation)}
-                            {...register("orgTranslation", {
-                                required: "orgTranslation is required."
-                            })}
+                            {...register("orgTranslation", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:82:43
                             type="text"
                             isInvalid={Boolean(errors.orgTranslation)}
                             {...register("orgTranslation", {
-                                required: "orgTranslation is required."
+                                required: ""
                             })}
                         />
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:86:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgTranslation && 'orgTranslation is required. '}
+                            {errors.orgTranslation || 'orgTranslation is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:86:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgTranslation && 'orgTranslation is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:105:54
                             id="inactive"
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", {
-                                required: "inactive is required.",pattern: inactive_regex
-                            })}
+                            {...register("inactive", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:106:43
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
                             {...register("inactive", {
-                                required: "inactive is required.",pattern: inactive_regex
+                                required: "",pattern: inactive_regex
                             })}
                         />
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
