[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:3:54
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBOrganizationCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBOrganizationCreatePage() {}
 
killedBy: UCSBOrganizationCreatePage tests Renders expected content
statusReason: Error: UCSBOrganizationCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
