[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:3:52
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBOrganizationEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBOrganizationEditPage() {}
 
killedBy: UCSBOrganizationEditPage tests Renders expected content
statusReason: Error: UCSBOrganizationEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
