[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:60:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'DateAdded is required. ' && 'DateAdded must be in ISO format'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /DateAdded must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:60:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'DateAdded is required. ' && 'DateAdded must be in ISO format'}
+                            {true && 'DateAdded must be in ISO format'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">DateAdded must be in ISO format</div> instead
