[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:55
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("diningCommonsCode", {
-                        required: "Code of dining common is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Code of dining common is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:34
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("diningCommonsCode", {
+                    {...register("", {
                         required: "Code of dining common is required.",
                         maxLength : {
killedBy: MenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:66:42
                     id="name"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("name", {
-                        required: "Name of item is required."
-                    })}
+                    {...register("name", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Name of item is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
