[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:12:20
 export default function MenuItemTable({
     menuItems,
     currentUser,
-    testIdPrefix = "MenuItemTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: MenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'Code of Dining Common',
-            accessor: 'diningCommonsCode',
-        },
+        {},
         {
             Header: 'Name',
killedBy: MenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:39:21
         },
 
         {
-            Header: 'Code of Dining Common',
+            Header: "",
             accessor: 'diningCommonsCode',
         },
killedBy: MenuItemTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Code of Dining Common. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:40:23
 
         {
             Header: 'Code of Dining Common',
-            accessor: 'diningCommonsCode',
+            accessor: "",
         },
         {
killedBy: MenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-diningCommonsCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
