[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:35
     }
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`New menuItem Created - id: ${menuItem.id} name: ${menuItem.name}`);
-  }
+  const onSuccess = (menuItem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItem Created - id: 3 name: Fish and Chips"

Number of calls: 0
