[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
-  const objectToAxiosParams = (organization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-     orgCode: organization.orgCode,
-     orgTranslationShort: organization.orgTranslationShort,
-     orgTranslation: organization.orgTranslation,
-     inactive: organization.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:8:50
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
-  const objectToAxiosParams = (organization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-     orgCode: organization.orgCode,
-     orgTranslationShort: organization.orgTranslationShort,
-     orgTranslation: organization.orgTranslation,
-     inactive: organization.inactive
-    }
-  });
+  const objectToAxiosParams = (organization) => ({});
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:39
     }
   });
 
-  const onSuccess = (organization) => {
-    toast(`New organization Created - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}
-    orgTranslation: ${organization.orgTranslation} inactive: ${organization.inactive}
-    `);
-  }
+  const onSuccess = (organization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO
    orgTranslation: ZETA PHI RHO inactive: false
    "

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:11
   });
 
   const onSuccess = (organization) => {
-    toast(`New organization Created - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}
-    orgTranslation: ${organization.orgTranslation} inactive: ${organization.inactive}
-    `);
+    toast(``);
   }
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: ZPR orgTranslationShort: ZETA PHI RHO
    orgTranslation: ZETA PHI RHO inactive: false
    "
Received: ""

Number of calls: 1
