[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:57:64
                             id="itemId"
                             type="number"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true, min: 1})}
+                            {...register("itemId", { required: false, min: 1})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:60:30
                             {...register("itemId", { required: true, min: 1})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.itemId && 'Item ID is required.'}
+                            {true}
                             {errors.itemId?.type === 'min' && 'Item ID must be greater than 0.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:60:30
                             {...register("itemId", { required: true, min: 1})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.itemId && 'Item ID is required.'}
+                            {false}
                             {errors.itemId?.type === 'min' && 'Item ID must be greater than 0.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:61:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required.'}
-                            {errors.itemId?.type === 'min' && 'Item ID must be greater than 0.'}
+                            {errors.itemId?.type === 'min' || 'Item ID must be greater than 0.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Item ID/

Here are the matching elements:

<label
  class="form-label"
  for="itemId"
>

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:61:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required.'}
-                            {errors.itemId?.type === 'min' && 'Item ID must be greater than 0.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages for Item ID value less than 0
statusReason: Error: Unable to find an element with the text: /Item ID must be greater than 0./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:76:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date reviewed is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:93:71
                             id="reviewerEmail"
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
-                            {...register("reviewerEmail", { required: true, pattern: email_regex })}
+                            {...register("reviewerEmail", { required: false, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:93:59
                             id="reviewerEmail"
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
-                            {...register("reviewerEmail", { required: true, pattern: email_regex })}
+                            {...register("reviewerEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Reviewer email must be an email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:96:30
                             {...register("reviewerEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && "Reviewer email is required."}
+                            {errors.reviewerEmail || "Reviewer email is required."}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be an email.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:96:30
                             {...register("reviewerEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && "Reviewer email is required."}
+                            {false}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be an email.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:97:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && "Reviewer email is required."}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be an email.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Reviewer email must be an email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:97:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && "Reviewer email is required."}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be an email.'}
+                            {errors.reviewerEmail?.type === 'pattern' || 'Reviewer email must be an email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Reviewer email must be an email.</div> instead

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:110:63
                             id="stars"
                             type="number"
                             isInvalid={Boolean(errors.stars)}
-                            {...register("stars", { required: true, min: 0, max: 5})}
+                            {...register("stars", { required: false, min: 0, max: 5})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:113:30
                             {...register("stars", { required: true, min: 0, max: 5})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.stars && 'Stars is required. '}
+                            {true}
                             {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars must be between 0 and 5.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:113:30
                             {...register("stars", { required: true, min: 0, max: 5})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.stars && 'Stars is required. '}
+                            {errors.stars || 'Stars is required. '}
                             {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars must be between 0 and 5.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:114:31
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars must be between 0 and 5.'}
+                            {(errors.stars.type === 'min' || errors.stars?.type === 'max') && 'Stars must be between 0 and 5.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:114:31
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars must be between 0 and 5.'}
+                            {(errors.stars?.type === 'min' && errors.stars?.type === 'max') && 'Stars must be between 0 and 5.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on value greater than 5 for stars
statusReason: Error: Unable to find an element with the text: /Stars must be between 0 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:131:66
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", { required: true })}
+                            {...register("comments", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:131:54
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", { required: true })}
+                            {...register("comments", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:134:30
                             {...register("comments", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.comments && 'Comments is required. '}
+                            {errors.comments || 'Comments is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:134:30
                             {...register("comments", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.comments && 'Comments is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
