[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:62:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'DateAdded is required. ' && 'DateAdded must be in ISO format'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /DateAdded must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:62:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'DateAdded is required. ' && 'DateAdded must be in ISO format'}
+                            {errors.dateAdded && 'DateAdded is required. ' || 'DateAdded must be in ISO format'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateAdded must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:141:51
                             id="email"
                             type="text"
                             isInvalid={Boolean(errors.email)}
-                            {...register("email", {
-                                required: "Email is required.", pattern: email_regex
-                            })}
+                            {...register("email", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: 
<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:142:43
                             type="text"
                             isInvalid={Boolean(errors.email)}
                             {...register("email", {
-                                required: "Email is required.", pattern: email_regex
+                                required: "", pattern: email_regex
                             })}
                         />
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: 
<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:146:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.email && 'Email is required. ' && 'Valid email has a a username followed by @ followed by a domain, followed by . and an extension of at least length 2'}
+                            {errors.email || 'Email is required. ' && 'Valid email has a a username followed by @ followed by a domain, followed by . and an extension of at least length 2'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Valid email has a a username followed by @ followed by a domain, followed by . and an extension of at least length 2</div> instead

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:146:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.email && 'Email is required. ' && 'Valid email has a a username followed by @ followed by a domain, followed by . and an extension of at least length 2'}
+                            {errors.email && 'Email is required. ' || 'Valid email has a a username followed by @ followed by a domain, followed by . and an extension of at least length 2'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: 
<body>
  <div>
    <form
      class=""
    >
      <div
